
#include "StructOfTwoFields.h" //включення власного файлу хедера
#include <iostream> // для std::cout, std::cerr
#include <cmath>    // для std::pow, std::fmod, std::isnan, std::isinf
#include <limits>   // для std::cin.ignore()


void StructOfTwoFields::Init(double a, double b)
{
    //перевірка чи a від'ємна і b неціле (fmod повертає дробову частину числа b)
    if (a < 0.0 && std::fmod(b, 1.0) != 0.0) 
    { 
        std::cerr << " Від'ємне число " << a << " не можна підносити до нецілого степеня" << b
                  << " Будуть втановлені нульові значення по замовчуванню для обох чисел"
                  << std::endl;
        first = 0.0;
        second = 0.0;
    }
    else 
    {
        first = a;
        second = b;
    }
}

void StructOfTwoFields::Read()
{
    double a;
    double b;

    //перевірка введення основи first 
    std::cout << "Уведіть число для підведення у ступінь (основу), наприклад, 1.5: ";
    while (!(std::cin>>a))
    {
        std::cerr<<"ВВедений невірний символ";
        std::cin.clear(); //cкидаємо прапорець помилки у разі невірного введення щоб потік cin знову міг приймати введення
        std::cin.ignore(32767, '\n'); //спрощений метод очищення буфера введення, де 32767 є макс значення для 16-бітного цілого
    }
    std::cin.ignore(32767, '\n'); //очищаємо буфер в разі успіху введення (символ \n від Enter залишається у буфері)


    //перевірка введення показника second 
    std::cout << "Введіть показник ступеня: ";
    while (!(std::cin>>b))
    {
        std::cerr << "ВВедений невірний символ";
        std::cin.clear();
        std::cin.ignore(32767, '\n');
    }
    std::cin.ignore(32767, '\n');

    Init(a, b);
}


void StructOfTwoFields::Display() const 
{
    std::cout<<"Основа: "<< first<<", Показник: "<< second <<std::endl; 
}
 
  
//Визначення функціі power з використання функцїї підведення до ступеня зі стандартної бібліотеки std::pow
double StructOfTwoFields::power() const

    //перевірки з метою оптимізації:
{
    //x^0 = 1; явна перевірка для підвищення продуктивності (перевірка швидше за складну pow)
    if (second == 0.0) return 1.0; 
    // 0^y = 0, y > 0; явна перевірка для підвищення продуктивності
    // попередня первірка вже обробила умову з 0^0(second == 0.0), і дана умова його вже ніколи не отримує
    if (first == 0.0 && second > 0.0) return 0.0; 
  
    //функція pow(x,y), де н це дійсний показниу, класично релізована так що x^y = e^(y*ln(x)), 
    //що накладає обмеження - якщо x < 0, то ln(x) не є дійсним числом
    //Як резуьтат реалізації pow(x,y) поверне NaN у разі від'ємної основи і нецілого показника (наприклад, -5.0^0.5).
    //математично якщо second= m/n, first^second= sqrt[n](first^m); NaN виникне якщо first < 0 і n парне число 
    double res = std::pow(first, second); 

    //Первірки на числові винятки NaN та Inf:

    if (std::isnan(res)) //явна перевірка чи результат NaN
    {
        std::cerr <<"Результат не є дійсним числом "<<std::endl;
        return 0.0;
    }
    if (std::isinf(res)) //перевірка чи результат є нескінченність (виникає при переповненні double, діленні на 0)
    {
        std::cout<<"Результат розрахунку є нескінченність" <<std::endl;
    }

    return res;
}



//Визначення власної функції MyMath::power

double MyMath::power(double base, double exp)
{
    //Оптимізаційні перевірки та спеціальні випадки (x^0, 0^y):

    // x^0 = 1.0; обробляється першим для уникнення складних обчислень для 0^0 та інших x
    if (exp == 0.0)
        return 1.0;

    //якщо нульова основа
    if (base == 0.0)
    {
        //0^y = 0.0 при y > 0. Випадок 0^0 вже оброблено попередьою перевіркою
        if (exp > 0.0)
            return 0.0;

        //при y < 0, 0^(-y) = 1/(0^y) = 1/0 = Inf
        //double і С++ повенуть нескінченнісь без виникнення помилки
        if (exp < 0.0)
            return std::numeric_limits<double>::infinity();
    }

  
    //Перевірка від'ємної основи (x < 0) та нецілого показника:

    //парний корінь з від'ємного числа (напр, (-5)^0.5не має дійсного результату і призводить до NaN 
    //std::fmod(exp, 1.0) != 0.0 перевіряє, чи є exp нецілим числом (повертає дробову частину числа exp)
    if (base < 0.0 && std::fmod(exp, 1.0) != 0.0)
    {
        std::cout<< "MyMath::power: Від'ємна основа та нецілий показник дали результат NaN" << std::endl;
        return std::numeric_limits<double>::quiet_NaN(); //повернення спец значення NaN
    }


    //Піднесення до степеня через тотожність x^y = exp(y * ln(x)):
    
    //тут розглядаються лише випадки base > 0, оскільки усі випадки base<= 0 вже перевірено перед цим
    //функція std::exp сама обробляї інші випадки з переповвенням;
    //якщо показник exp*(log(base)) перевищує приблизно 709.78 (ln(MAX_DOUBLE)) std::exp повертає +Inf (це вимоги стандарту IEEE 754 до математичних функцій)
    double result = std::exp(exp * std::log(base));

    //!:явна перевірка на isinf(result) як в попередній реалізаціі power тут не потрібна,
    //оскільки std::exp та std::log є основними функціями і їхня поведінка щодо Inf так ж
    //як і в функції std::pow, яка реалізована з їх допомогою
   
    return result;
}